experimental_cases/STR_500mL_rotatingMesh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          birdmultiphaseEuler;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          1e-5;

writeControl    runTime;

writeInterval   0.02;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;

maxDeltaT       1;

/*
functions
{
    #includeFunc fieldAverage(U.gas, U.liquid, alpha.gas, p)
    #includeFunc    writeObjects(d.gas)
}*/


// ************************************************************************* //
