experimental_cases/STR_500mL_rotatingMesh/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "$FOAM_CASE/constant/globalVars"

type interfaceCompositionPhaseChangePopulationBalanceMultiphaseSystem;

phases (gas liquid);

populationBalances (bubbles);


gas
{
    type            multiComponentPhaseModel;//pureIsothermalPhaseModel;

    diameterModel   velocityGroup;

    velocityGroupCoeffs
    {
        populationBalance    bubbles;

        shapeModel           spherical;

        sizeGroups
        (
            {dSph  1e-3;}
            {dSph  1.5e-3;}
            {dSph  2e-3; }
            {dSph  2.5e-3; }
            {dSph  3e-3; }
            {dSph  3.5e-3; }
            {dSph  4e-3; }
            {dSph  4.5e-3; }
            {dSph  5e-3; }
            {dSph  5.5e-3; }
            {dSph  6e-3; }
            {dSph  6.5e-3; }
            {dSph  7e-3; }
            {dSph  7.5e-3; }
            {dSph  8e-3; }
            {dSph  8.5e-3; }
            {dSph  9e-3; }
            {dSph  9.5e-3; }
            {dSph  10e-3; }
            {dSph  10.5e-3; }
            {dSph  11e-3; }
        );
    }

    residualAlpha   1e-2;
}

populationBalanceCoeffs
{
    bubbles
    {
        continuousPhase liquid;

        coalescenceModels
        (
            LehrMilliesMewes
            {}
        );

        binaryBreakupModels
        (
            LehrMilliesMewes
            {}
        );

        breakupModels
        ();

        driftModels
        (
            densityChange
            {}
        );

        nucleationModels
        ();
    }
}

liquid
{
    type            multiComponentPhaseModel;//pureIsothermalPhaseModel;

    diameterModel   constant;

    constantCoeffs
    {
        d               1e-4;
    }
    Sc   #codeStream 
    { 
        code 
        #{ 
            os  << ($LeLiqMix * $CpMixLiq * $muMixLiq / $kThermLiq); 
        #}; 
    }; 

    residualAlpha   1e-6;
}

blending
{
    default
    {
        type            linear;
        minFullyContinuousAlpha.gas 0.7;
        minPartlyContinuousAlpha.gas 0.3;
        minFullyContinuousAlpha.liquid 0.7;
        minPartlyContinuousAlpha.liquid 0.3;
    }

    drag
    {
        type            linear;
        minFullyContinuousAlpha.gas 0.7;
        minPartlyContinuousAlpha.gas 0.5;
        minFullyContinuousAlpha.liquid 0.7;
        minPartlyContinuousAlpha.liquid 0.5;
    }

    heatTransfer
    {
        type            linear;
        minPartlyContinuousAlpha.gas 0;
        minFullyContinuousAlpha.gas 1;
        minPartlyContinuousAlpha.liquid 0;
        minFullyContinuousAlpha.liquid 1;
    }

    diffusiveMassTransfer
    {
        $heatTransfer;
    }

}

surfaceTension
{
    gas_liquid
    {
        type            constant;
        sigma           0.07;
    }
}

drag
{
    gas_dispersedIn_liquid
    {
        type            SchillerNaumann;
    }

    liquid_dispersedIn_gas
    {
        type            SchillerNaumann;
    }

    gas_segregatedWith_liquid
    {
        type            segregated;
        m               0.5;
        n               8;
    }
}

virtualMass
{
    gas_dispersedIn_liquid
    {
        type            constantCoefficient;
        Cvm             0.5;
    }

    liquid_dispersedIn_gas
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
}

heatTransfer
{
    gas_dispersedIn_liquid_inThe_gas
    {
        type spherical;
        residualAlpha 1e-4;
    }

    gas_dispersedIn_liquid_inThe_liquid
    {
        type RanzMarshall;
        residualAlpha 1e-4;
    }

    liquid_dispersedIn_gas_inThe_gas
    {
        type RanzMarshall;
        residualAlpha 1e-4;
    }

    liquid_dispersedIn_gas_inThe_liquid
    {
        type spherical;
        residualAlpha 1e-4;
    }

}

diffusiveMassTransfer
{
    gas_dispersedIn_liquid_inThe_liquid
    {
        type Frossling;
        Le $LeLiqMix;
    }

    liquid_dispersedIn_gas_inThe_liquid
    {
        type spherical;
        Le 1.0; 
    }

    gas_dispersedIn_liquid_inThe_gas
    {
        type Frossling;
        Le $LeLiqMix;
    }

    liquid_dispersedIn_gas_inThe_gas
    {
        type spherical;
        Le 1.0; 
    }
}


interfaceComposition
{
 /*   gas_liquid_inThe_gas
    {   
        type saturated;
        species ( H2O );
        Le $LeGas;
        pSat
        {   
            type ArdenBuck;
        }
    }
*/
    gas_liquid_inThe_liquid
    {   
        type Henry;
        species ( O2 );
        k ( $He_O2 );
        Le $LeLiqMix;
    }
}



phaseTransfer
{}

lift
{}

wallLubrication
{
    gas_dispersedIn_liquid
    {
        type            Antal;
        Cw1             -0.01;
        Cw2             0.05;
    }

    liquid_dispersedIn_gas
    {
        type            Antal;
        Cw1             -0.01;
        Cw2             0.05;
    }
}

turbulentDispersion
{
    gas_dispersedIn_liquid
    {
        type            Burns;
        sigma           0.9;
    }

    liquid_dispersedIn_gas
    {
        type            Burns;
        sigma           0.9;
    }
}


interfaceCompression
{}

// ************************************************************************* //
